sstlm/attack10/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.9; 
}

gradSchemes
{
    default         Gauss linear cellMDLimited;
    grad(U)         Gauss linear cellMDLimited;
    grad(p)          Gauss linear cellMDLimited;
    grad(k)          Gauss linear cellMDLimited;
     grad(omega)          Gauss linear cellMDLimited;
}

divSchemes
{
    default         Gauss ;
    div(phi,U)      Gauss limitedLinear 1;
    div(phi,k)      Gauss QUICK;
    div(phi,omega)  Gauss QUICK;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
 div(phi,gammaInt)   bounded Gauss linearUpwind grad;
    div(phi,ReThetat)   bounded Gauss linearUpwind grad;
}


laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}



interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
wallDist
{
    method meshWave;
}


// ************************************************************************* //
